# primitive(원시)타입 -> import              파이썬에서 날짜는 확장타입이다
# 값 1개 : int float str bool
   # 숫자 -> 정수(int), 실수(float)
   # 문자열 -> str
   # 참거짓 -> bool

# 값 여러개 = sequence = 집합
   # 순서대로 읽고 쓴다 : list,      tuple
   #                 [175,180,165]  (175,180,165)                
   #계산으로 위치파악 : set {175,180,165}
   #키와 값의 쌍(pair) : dictionary (리스트+리스트)
   #{'홍길동':1, '전우치':180, '임꺽정:165}
   # ['홍길동','전우치','임꺽정']
   # [175,180,165]
   #      



   #list        [1,2,3]
   #tuple       (1,2,3) - 변경불가능 - 읽기전용 
   #set         {1,2,3} 계산에 의해 위치가 정해진다 예) %10(10으로 나눈 나머지 몫의 위치 0123456789) 
   #dictionary
   #리스트 튜플은 값을 순서대로 하나씩 읽어낸다 = for

